; domain
(define (domain drone-dom)

    (:requirements
        :typing
    )

    (:types
        drone human box content location - object
    )

    (:predicates
        (drone-at ?d - drone ?l - location) 
        (drone-free ?d - drone)
        (drone-carry ?d - drone ?b - box)
        (human-at ?h - human ?l - location)
        (human-has ?h - human ?c - content)
        (box-at ?b - box ?l - location)
        (box-has ?b - box ?c - content)
        (box-free ?b - box)
    )

    (:action move
        :parameters (?d - drone ?from ?to - location)
        :precondition (and 
            (drone-at ?d ?from)
        )
        :effect (and
            (drone-at ?d ?to) 
            (not (drone-at ?d ?from))
        )
    )
    
    (:action pick-up
        :parameters (?d - drone ?b - box ?c - content ?l - location)
        :precondition (and 
            (drone-at ?d ?l)
            (box-at ?b ?l)
            (drone-free ?d)
            (box-has ?b ?c)
            (box-free ?b)
        )
        :effect (and
            (drone-carry ?d ?b)
            (not (drone-free ?d))
            (not (box-at ?b ?l))
        )
    )
    
    (:action drop
        :parameters (?d - drone ?b - box ?c - content ?l - location ?h - human)
        :precondition (and 
            (drone-carry ?d ?b)
            (drone-at ?d ?l)
            (human-at ?h ?l)
            (box-has ?b ?c)
        )
        :effect (and
            (drone-free ?d)
            (box-at ?b ?l)
            (human-has ?h ?c)
            (not (drone-carry ?d ?b))
            (not (box-free ?b))
        )
    )
)

; problem
(define (problem drone_problem_d1_r0_l5_p5_c5_g5_ct2)
(:domain drone-dom)
(:objects
	drone1 - drone
	warehouse - location
	loc1 - location
	loc2 - location
	loc3 - location
	loc4 - location
	loc5 - location
	box1 - box
	box2 - box
	box3 - box
	box4 - box
	box5 - box
	food - content
	meds - content
	human1 - human
	human2 - human
	human3 - human
	human4 - human
	human5 - human
)

(:init
	(drone-at drone1 warehouse)
	(drone-free drone1)
	(box-at box1 warehouse)
	(box-free box1)
	(box-at box2 warehouse)
	(box-free box2)
	(box-at box3 warehouse)
	(box-free box3)
	(box-at box4 warehouse)
	(box-free box4)
	(box-at box5 warehouse)
	(box-free box5)
	(box-has box1 food)
	(box-has box2 meds)
	(box-has box3 meds)
	(box-has box4 meds)
	(box-has box5 meds)
	(human-at human1 loc4)
	(human-at human2 loc4)
	(human-at human3 loc4)
	(human-at human4 loc4)
	(human-at human5 loc1)
)

(:goal (and

	(drone-at drone1 warehouse)
	(human-has human1 meds)
	(human-has human2 meds)
	(human-has human4 food)
	(human-has human4 meds)
	(human-has human5 meds)
	))
)

; plan
1. (pick-up drone1 box3 meds warehouse)
   deleted: (drone-free drone1) (box-at box3 warehouse)
   added: (drone-carry drone1 box3)
   goals met: 1 of 6
2. (move drone1 warehouse loc1)
   deleted: (drone-at drone1 warehouse)
   added: (drone-at drone1 loc1)
   goals met: 0 of 6
3. (drop drone1 box3 meds loc1 human5)
   deleted: (drone-carry drone1 box3) (box-free box3)
   added: (drone-free drone1) (box-at box3 loc1) (human-has human5 meds)
   goals met: 1 of 6
4. (move drone1 loc1 warehouse)
   deleted: (drone-at drone1 loc1)
   added: (drone-at drone1 warehouse)
   goals met: 2 of 6
5. (pick-up drone1 box1 food warehouse)
   deleted: (drone-free drone1) (box-at box1 warehouse)
   added: (drone-carry drone1 box1)
   goals met: 2 of 6
6. (move drone1 warehouse loc4)
   deleted: (drone-at drone1 warehouse)
   added: (drone-at drone1 loc4)
   goals met: 1 of 6
7. (drop drone1 box1 food loc4 human4)
   deleted: (drone-carry drone1 box1) (box-free box1)
   added: (drone-free drone1) (box-at box1 loc4) (human-has human4 food)
   goals met: 2 of 6
8. (move drone1 loc4 warehouse)
   deleted: (drone-at drone1 loc4)
   added: (drone-at drone1 warehouse)
   goals met: 3 of 6
9. (pick-up drone1 box5 meds warehouse)
   deleted: (drone-free drone1) (box-at box5 warehouse)
   added: (drone-carry drone1 box5)
   goals met: 3 of 6
10. (move drone1 warehouse loc4)
   deleted: (drone-at drone1 warehouse)
   added: (drone-at drone1 loc4)
   goals met: 2 of 6
11. (drop drone1 box5 meds loc4 human1)
   deleted: (drone-carry drone1 box5) (box-free box5)
   added: (drone-free drone1) (box-at box5 loc4) (human-has human1 meds)
   goals met: 3 of 6
12. (move drone1 loc4 warehouse)
   deleted: (drone-at drone1 loc4)
   added: (drone-at drone1 warehouse)
   goals met: 4 of 6
13. (pick-up drone1 box2 meds warehouse)
   deleted: (drone-free drone1) (box-at box2 warehouse)
   added: (drone-carry drone1 box2)
   goals met: 4 of 6
14. (move drone1 warehouse loc4)
   deleted: (drone-at drone1 warehouse)
   added: (drone-at drone1 loc4)
   goals met: 3 of 6
15. (drop drone1 box2 meds loc4 human2)
   deleted: (drone-carry drone1 box2) (box-free box2)
   added: (drone-free drone1) (box-at box2 loc4) (human-has human2 meds)
   goals met: 4 of 6
16. (move drone1 loc4 warehouse)
   deleted: (drone-at drone1 loc4)
   added: (drone-at drone1 warehouse)
   goals met: 5 of 6
17. (pick-up drone1 box4 meds warehouse)
   deleted: (drone-free drone1) (box-at box4 warehouse)
   added: (drone-carry drone1 box4)
   goals met: 5 of 6
18. (move drone1 warehouse loc4)
   deleted: (drone-at drone1 warehouse)
   added: (drone-at drone1 loc4)
   goals met: 4 of 6
19. (drop drone1 box4 meds loc4 human4)
   deleted: (drone-carry drone1 box4) (box-free box4)
   added: (drone-free drone1) (box-at box4 loc4) (human-has human4 meds)
   goals met: 5 of 6
20. (move drone1 loc4 warehouse)
   deleted: (drone-at drone1 loc4)
   added: (drone-at drone1 warehouse)
   goals met: 6 of 6
